Autodesk.Revit.DB.Structure.AnalyticalNodeConnectionStatus
Indicates the Connections Status for an Analytical Node.
Since:
2023
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalNodeConnectionStatus.Connected
Connected

Autodesk.Revit.DB.Structure.AnalyticalNodeConnectionStatus.Unconnected
Unconnected node (only one connected element)